/**
 * 支持的图谱类型
 */
export const chartType = {
    amplitude: 1, //幅值图谱-AE
    ae: 1.1, //幅值图谱-AE
    wave: 2, //波形图谱-AE
    phase: 3, //相位图谱-AE
    fly: 4, //飞行图谱-AE
    prps2d: 5, //PRPS二维图谱-UHF、HFCT
    prps3d: 6, //PRPS三维图谱-UHF、HFCT
    prpd2d: 7, //PRPD二维图谱-UHF、HFCT
    prpd3d: 8, //PRPD三维图谱-UHF、HFCT
    prpsd: 9, //PRPSD三维图谱 - UHF、HFCT
    dashboard: 10, //仪表盘图谱-湿度、电流、电压、声压
    earthcurrent: 10.1, //老版本的地电压
    infrared: 11, //红外图谱 - 图片
    mech: 12, //机械特性图谱-电机电流、原始电流、扭矩、震动信号、震动频率、行程曲线、线圈电流、开关量曲线，高频脉冲波形图
    cycle: 13, //周期图谱-UHF、HFCT
    temperature: 14, //温度计图谱-温度
    sphere: 15, //球形图谱-水位、单气体浓度
    battery: 16, //蓄电池图谱-蓄电池电压、内阻、温度
    gasdensity: 17, //气体浓度图谱 - 油色谱
    gastiming: 18, //气体浓度时序图谱 - 油色谱
    audio: 19, //音频图谱-AE
    pulse: 20, //波形图谱-HFCT
    pdischarge: 21, //振荡波-局放图谱-放电量
    dischargetimes: 22, //振荡波-局放图谱-放电次数
    compression: 23, //振荡波-加压图谱
    tev:24
};

/**
 * 支持相位偏移的图谱
 */
export const pashShiftCharts = [
    chartType.phase,
    chartType.prpd2d,
    chartType.prps2d,
    chartType.prpd3d,
    chartType.prps3d,
    chartType.prpsd,
    chartType.cycle,
]

/**
 * 支持阈值过滤的图谱
 */
export const thresholdFilterCharts = [
    chartType.prps3d,
    chartType.prpsd,
]

/**
 * 支持周期偏移的图谱
 */
export const cycleShiftCharts = [
    chartType.prps3d,
    chartType.prpsd,
]

/**
 * 图谱初始配置
 */
export const initOption = {
    engine: 'canvas',
    type: '',
    data: [],
    cover: false, //是否平铺，默认居中显示
    width: '100%',
    height: '100%',
    background: 'transparent',
    color: '#eee', //截图服务时'#000'
    lineWidth: 1,
    fontSize: 12,
    autoCycle: false, //PRPS/PRPD是否自动播放相位偏移
    stopPropagation: true, //是否阻止父容器点击事件冒泡穿透
}

/**
 * 系统常量
 */
export const common = {
    splitNum: 2000,
    sinColor: '#1E90FF',
    infraredColor: '#00ff00',
    playIcon: 'M512 67C266.6 67 67 266.6 67 512s199.6 445 445 445 445-199.6 445-445S757.4 67 512 67z m0 826.1c-210.1 0-381.1-171-381.1-381.1 0-210.1 171-381.2 381.1-381.2s381.1 171 381.1 381.2c0 210.1-171 381.1-381.1 381.1z m151.8-413L444.7 353.6c-30.5-17.6-55.3-3.2-55.3 31.9v253.1c0 35.1 24.9 49.5 55.3 31.9L663.8 544c30.4-17.6 30.4-46.3 0-63.9z',
    pauseIcon: 'M501.282133 22.801067c263.509333 0 477.866667 214.357333 477.866667 477.866666s-214.357333 477.866667-477.866667 477.866667-477.866667-214.357333-477.866666-477.866667 214.357333-477.866667 477.866666-477.866666z m0 887.1936a409.8048 409.8048 0 0 0 409.258667-409.326934A409.8048 409.8048 0 0 0 501.282133 91.477333a409.8048 409.8048 0 0 0-409.326933 409.258667 409.8048 409.8048 0 0 0 409.326933 409.326933zM413.2864 317.0304c19.456 0 35.362133 13.653333 35.362133 30.583467v306.107733c0 16.861867-15.837867 30.583467-35.362133 30.583467-19.592533 0-35.498667-13.653333-35.498667-30.583467V347.613867c0-16.930133 15.9744-30.583467 35.498667-30.583467z m175.991467 0c-19.592533 0-35.4304 13.653333-35.4304 30.583467v306.107733c0 16.861867 15.7696 30.583467 35.4304 30.583467 19.592533 0 35.4304-13.653333 35.4304-30.583467V347.613867c0-16.930133-15.906133-30.583467-35.498667-30.583467z',
    zoomOut: 'M123.84 470.08h776.32a41.92 41.92 0 0 1 0 83.84H123.84a41.92 41.92 0 1 1 0-83.84zM470.08 900.16V123.84a41.92 41.92 0 0 1 83.84 0v776.32a41.92 41.92 0 1 1-83.84 0z',
    zoomIn: 'M123.84 461.6h776.32a41.92 41.92 0 0 1 0 83.84H123.84a41.92 41.92 0 1 1 0-83.84z',
    phaseShiftIcon: 'path://m 359.83826,608.05963 h 304.32345 v 78.66483 H 359.83826 Z m 0.62948,-303.94156 h 303.06452 v 78.67438 H 360.46774 Z m 101.17224,75.24835 H 562.36002 V 609.40771 H 461.63998 Z M 512,0 C 229.23256,0 7.1525574e-6,229.23255 7.1525574e-6,512 7.1525574e-6,794.76745 229.23256,1024 512,1024 794.76745,1024 1024,794.76745 1024,512 1024,229.23255 794.76745,0 512,0 Z m 0,969.30411 C 259.4185,969.30411 54.6959,764.58151 54.6959,512 54.6959,259.41849 259.4185,54.695893 512,54.695893 764.58151,54.695893 969.30411,259.41849 969.30411,512 969.30411,764.58151 764.58151,969.30411 512,969.30411 Z m 0,0',
    thresholdFilterIcon: 'path://m 278.06561,473.33563 h 485.22467 v 77.32874 H 278.06561 Z M 461.63998,414.19647 H 562.36002 V 609.80353 H 461.63998 Z M 512,0 C 229.23256,0 7.1525574e-6,229.23255 7.1525574e-6,512 7.1525574e-6,794.76745 229.23256,1024 512,1024 794.76745,1024 1024,794.76745 1024,512 1024,229.23255 794.76745,0 512,0 Z m 0,969.30411 C 259.4185,969.30411 54.6959,764.58151 54.6959,512 54.6959,259.41849 259.4185,54.695893 512,54.695893 764.58151,54.695893 969.30411,259.41849 969.30411,512 969.30411,764.58151 764.58151,969.30411 512,969.30411 Z m 0,0',

}